# программа для расчёта площади прямоугольной комнаты
# a = float(input('Введите длину комнаты в метрах: '))
# b = float(input('Введите ширину комнаты в метрах: '))
#
# s = a * b  # формула площади прямоугольника
#
# print('Площадь равна = ', s)
#
# # или
#
# # print('Площадь равна = ' + str(s))

# -----------------------------------------------------------

# Задачки

# ----------------------------------------------------------

# задача 1

# number = int(input('Введите двузначное целое положительное число: '))
#
# #первое число
# a = number // 10
#
# # второе число
# b = number % 10
#
# plus = a + b
# # умножение
# umno = a * b
#
# print('Cумма чисел = ', plus)
# print('Произведение чисел = ', umno)

# -----------------------------------------------------------

# задача 2

# people = int(input('Введите количество людей: '))
#
# people2 = people // 2 + people % 2
#
# print('Из', people, 'выживут только', people2, 'человек')

# --------------------------------------------------------------

# задача 3
# человек вводит минуты и получает минуты и часы

# minutes = int(input('Введите минуты: '))
#
# casi = minutes // 60
# remains = minutes % 60
#
# print(casi, 'час и', remains, 'минут')
