# sites = ['Москва', 'Пермь', 'Казань', 'Тверь']
#
# # методы по работе со списками
#
# # del sites[3] # удаляет элемент списка
# # sites.append('Питер')  # добавляет элемент в конец списка
# sites.insert(1, 'Питер')  # добавляет элемент на указанную позицию
#
# print(sites)

# -------------------------------------------------------------------------

# list = [1, 2, 3, 4, 5]
#
# sum = list[0] + list[1] + list[2]
#
# del list[0]
# del list[0]
# del list[0]
# list.insert(0, sum)
# list.insert(0, sum)
# list.insert(0, sum)
# list.append(7)
# list.insert(-1, list[0])
# del list[0]
#
# print(list)

# или

# list.pop(0)

# --------------------------------------------------------------------------

# цикл по возрастанию

# a = 0
#
# while a < 5:
#     a += 1  # a = a + 1
#     print(a, 'Hello')

# --------------------------------------------------------------------------

# цикл по убыванию

# a = 10
#
# while a > 0:
#     a -= 1
#     print(a, 'Hello')

# ----------------------------------------------------------------------------

# a = 10
#
# while a > 0:
#     a -= 2
#     print(a, 'Hello')

# ------------------------------------------------------------------------------

# Пользователь вводит с клавиатуры два целых числа.
# Вычислить, какое из чисел является наибольшим, а какое - наименьшим
# Используя цикл WHILE вывести все числа от наименьшего до наибольшего.

# num = int(input('Введите первое целое число: '))
# num2 = int(input('Введите второе целое число: '))
#
# if num > num2:
#     max = num
#     min = num2
# else:
#     max = num2
#     min = num
#
# while min <= max:
#     print(min)
#     min += 1

# или

# num1 = int(input('Введите целое число: '))
# num2 = int(input('Введите целое число: '))
#
# min = min(num1, num2)
# max = max(num1, num2)
#
# while min <= max:
#     print(min)
#     min += 1

# -------------------------------------------------------------------------

# a = 0
# summa = 0
#
# while a < 10:
#     a += 1
#     summa += a
# print(summa)
#
# a = 0
# multiply = 1
#
# while a < 10:
#     a += 1
#     multiply *= a
# print(multiply)
